[
    {
        "feedbackId": 1,
        "nim": "1301190001",
        "name": "MIFTAH FARID MAULANA",
        "kelas": "TK-45-06",
        "title": "Kesulitan dalam Mata Kuliah Algoritma",
        "feedbackDate": "2025-03-10T14:30:00",
        "details": "Saya mengalami kesulitan dalam memahami materi terkait algoritma sorting pada mata kuliah Algoritma dan Pemrograman. Apakah ada rekomendasi sumber belajar tambahan?",
        "responseDate": "2025-03-20",
        "response": "Terima kasih atas feedback-nya. Saya merekomendasikan untuk mengunjungi lab praktikum di lantai 3 gedung utara, mereka memiliki sesi tutorial setiap Rabu. Selain itu, ada beberapa video pembelajaran di LMS yang bisa Anda tonton ulang.",
        "status": "In Progress"
    },
    {
        "feedbackId": 2,
        "nim": "1301190001",
        "name": "MIFTAH FARID MAULANA",
        "kelas": "TK-45-06",
        "title": "Konsultasi Pemilihan Mata Kuliah Pilihan",
        "feedbackDate": "2025-03-12T10:15:00",
        "details": "Saya ingin berkonsultasi mengenai mata kuliah pilihan yang sebaiknya saya ambil di semester depan jika saya tertarik pada bidang Data Science.",
        "responseDate": "2025-03-20",
        "response": "Berdasarkan minat Anda di bidang Data Science, saya sarankan untuk mengambil mata kuliah Pengantar Pemrosesan Data, Statistika Komputasi, dan Machine Learning dasar. Mari kita diskusikan lebih lanjut di jadwal bimbingan akademik minggu depan.",
        "status": "Resolved"
    },
    {
        "feedbackId": 3,
        "nim": "1301190001",
        "name": "MIFTAH FARID MAULANA",
        "kelas": "TK-45-06",
        "title": "Izin Tidak Mengikuti UTS",
        "feedbackDate": "2025-03-15T09:00:00",
        "details": "Saya ingin meminta izin untuk tidak mengikuti UTS mata kuliah Basis Data karena harus menjalani operasi usus buntu. Saya telah melampirkan surat keterangan dokter di email terpisah.",
        "responseDate": "2025-03-20",
        "response": "Izin Anda sudah saya terima. Mohon segera setelah pulih untuk mengurus prosedur UTS susulan di bagian akademik. Semoga operasinya lancar dan cepat sembuh.",
        "status": "In Progress"
    },
    {
        "feedbackId": 4,
        "nim": "1301190001",
        "name": "MIFTAH FARID MAULANA",
        "kelas": "TK-45-06",
        "title": "Kendala Teknis saat Kuliah Daring",
        "feedbackDate": "2025-03-18T13:45:00",
        "details": "Saya mengalami masalah koneksi internet yang tidak stabil saat mengikuti kuliah daring, sehingga sering tertinggal materi penting. Apakah ada solusi atau kebijakan khusus untuk kondisi ini?",
        "responseDate": "2025-03-20",
        "response": "Untuk mengatasi kendala tersebut, semua perkuliahan daring direkam dan dapat diakses di repositori kuliah selama 2 minggu. Selain itu, Anda bisa menggunakan fasilitas internet kampus di perpustakaan jika memungkinkan.",
        "status": "In Progress"
    },
    {
        "feedbackId": 5,
        "nim": "1301190001",
        "name": "MIFTAH FARID MAULANA",
        "kelas": "TK-45-06",
        "title": "Bimbingan Skripsi",
        "feedbackDate": "2025-03-20T15:30:00",
        "details": "Saya ingin meminta jadwal bimbingan skripsi untuk minggu ini. Ada beberapa poin yang perlu saya konsultasikan terkait metodologi penelitian yang saya gunakan.",
        "responseDate": "2025-03-20",
        "response": "Saya bisa melakukan bimbingan pada hari Jumat, 24 Maret pukul 13.00-15.00 di ruang dosen lantai 4. Mohon siapkan dokumen penelitian Anda dan pertanyaan spesifik yang ingin dibahas.",
        "status": "Pending"
    },
    {
        "feedbackId": 6,
        "nim": "1301210045",
        "name": "ANISA RAHMA PUTRI",
        "kelas": "TI-43-02",
        "title": "Permintaan Surat Rekomendasi",
        "feedbackDate": "2025-03-21T09:15:00",
        "details": "Saya ingin meminta surat rekomendasi untuk program pertukaran pelajar ke Jepang. Deadline pengumpulan dokumen adalah 10 April 2025.",
        "responseDate": "2025-03-22",
        "response": "Saya akan mempersiapkan surat rekomendasi untuk Anda. Mohon kirimkan CV terbaru, transkrip nilai, dan detail program pertukaran pelajar tersebut ke email saya paling lambat 27 Maret agar saya memiliki waktu yang cukup untuk membuatnya.",
        "status": "In Progress"
    },
    {
        "feedbackId": 7,
        "nim": "1301190078",
        "name": "BUDI SANTOSO",
        "kelas": "SI-44-03",
        "title": "Permohonan Magang Industri",
        "feedbackDate": "2025-03-18T11:20:00",
        "details": "Saya ingin meminta informasi tentang prosedur permohonan magang industri untuk semester depan di perusahaan teknologi. Apa saja dokumen yang perlu saya siapkan dan bagaimana alur prosesnya?",
        "responseDate": "2025-03-23",
        "response": "Untuk magang industri, Anda perlu menyiapkan proposal magang, CV, surat permohonan, dan formulir pendaftaran yang tersedia di portal akademik. Silakan datang ke kantor Hubungan Industri di Gedung C lantai 1 setiap Senin-Jumat pukul 09.00-15.00 untuk konsultasi lebih lanjut.",
        "status": "Resolved"
    },
    {
        "feedbackId": 8,
        "nim": "1301200123",
        "name": "DIAN PERMATA SARI",
        "kelas": "TK-44-01",
        "title": "Pengajuan Beasiswa Prestasi",
        "feedbackDate": "2025-03-19T13:40:00",
        "details": "Saya ingin mengajukan permohonan beasiswa prestasi akademik berdasarkan nilai IPK semester lalu yang mencapai 3.95. Apakah saya memenuhi syarat dan bagaimana prosedur pengajuannya?",
        "responseDate": "2025-03-24",
        "response": "Selamat! Dengan IPK 3.95, Anda memenuhi syarat untuk beasiswa prestasi. Silakan lengkapi formulir pengajuan di sistem beasiswa kampus sebelum tanggal 5 April 2025. Jangan lupa melampirkan transkrip nilai, sertifikat prestasi, dan surat pernyataan tidak sedang menerima beasiswa lain.",
        "status": "Resolved"
    },
    {
        "feedbackId": 9,
        "nim": "1301200056",
        "name": "FARHAN AHMAD",
        "kelas": "SI-43-04",
        "title": "Masalah Akses Perpustakaan Digital",
        "feedbackDate": "2025-03-22T10:05:00",
        "details": "Saya tidak dapat mengakses jurnal-jurnal internasional pada perpustakaan digital kampus. Sistem selalu menampilkan pesan error saat saya mencoba login menggunakan akun saya.",
        "responseDate": "",
        "response": "",
        "status": "Pending"
    },
    {
        "feedbackId": 10,
        "nim": "1301190145",
        "name": "GITA PARAMITA",
        "kelas": "TK-45-03",
        "title": "Kesulitan Mendapatkan Referensi Tugas Akhir",
        "feedbackDate": "2025-03-20T16:45:00",
        "details": "Saya kesulitan menemukan referensi untuk tugas akhir saya tentang Implementasi Blockchain pada Supply Chain Management. Apakah dosen pembimbing memiliki rekomendasi sumber atau kontak peneliti di bidang ini?",
        "responseDate": "2025-03-23",
        "response": "Saya merekomendasikan Anda untuk mengakses jurnal IEEE, ACM Digital Library, dan repository kampus yang memiliki koleksi lengkap tentang topik ini. Selain itu, saya akan mengenalkan Anda dengan Pak Dr. Hendra dari Fakultas Teknik yang sedang meneliti topik serupa.",
        "status": "In Progress"
    },
    {
        "feedbackId": 11,
        "nim": "1301210078",
        "name": "HENDRA WIJAYA",
        "kelas": "TI-43-05",
        "title": "Permohonan Reset Password",
        "feedbackDate": "2025-03-23T08:30:00",
        "details": "Saya tidak bisa mengakses akun LMS karena lupa password dan nomor telepon yang terdaftar sudah tidak aktif. Mohon bantuan untuk reset password.",
        "responseDate": "2025-03-23",
        "response": "Password Anda sudah direset ke NIM+tanggal lahir (format: YYYYMMDD). Mohon segera ubah password setelah berhasil login dan perbarui informasi kontak Anda di profil.",
        "status": "Resolved"
    },
    {
        "feedbackId": 12,
        "nim": "1301200111",
        "name": "IRFAN HAKIM",
        "kelas": "SI-44-01",
        "title": "Usulan Penambahan Mata Kuliah",
        "feedbackDate": "2025-03-21T14:20:00",
        "details": "Saya ingin mengusulkan penambahan mata kuliah 'Keamanan Siber dan Etika Digital' sebagai mata kuliah wajib untuk program studi Sistem Informasi. Banyak mahasiswa yang merasakan pentingnya topik ini untuk karir mereka.",
        "responseDate": "",
        "response": "",
        "status": "Pending"
    },
    {
        "feedbackId": 13,
        "nim": "1301210023",
        "name": "JESSICA ANGGRAINI",
        "kelas": "TK-43-04",
        "title": "Pengajuan Tugas Akhir",
        "feedbackDate": "2025-03-22T09:45:00",
        "details": "Saya ingin mengajukan judul tugas akhir 'Pengembangan Sistem Deteksi Emosi Berbasis AI untuk Evaluasi Layanan Pelanggan'. Apakah topik ini sesuai dengan bidang penelitian program studi?",
        "responseDate": "2025-03-24",
        "response": "Topik yang Anda ajukan sangat relevan dengan fokus riset program studi. Silakan lengkapi formulir pengajuan tugas akhir dan proposal awal untuk dibahas dalam seminar proposal minggu depan. Saya merekomendasikan Dr. Ratna sebagai pembimbing utama karena keahliannya di bidang AI.",
        "status": "In Progress"
    },
    {
        "feedbackId": 14,
        "nim": "1301190189",
        "name": "KEVIN PRATAMA",
        "kelas": "TI-45-02",
        "title": "Permohonan Transfer Kredit",
        "feedbackDate": "2025-03-23T11:00:00",
        "details": "Saya adalah mahasiswa transfer dari Universitas XYZ dan ingin mengajukan transfer kredit untuk beberapa mata kuliah yang sudah saya ambil sebelumnya. Bagaimana prosedurnya?",
        "responseDate": "2025-03-25",
        "response": "Untuk transfer kredit, Anda perlu menyerahkan transkrip resmi dari universitas asal, silabus lengkap mata kuliah yang ingin ditransfer, dan mengisi formulir konversi SKS di bagian akademik. Proses evaluasi membutuhkan waktu sekitar 2 minggu.",
        "status": "Resolved"
    },
    {
        "feedbackId": 15,
        "nim": "1301200076",
        "name": "LARAS WULANDARI",
        "kelas": "SI-43-03",
        "title": "Permohonan Perpanjangan Deadline Tugas",
        "feedbackDate": "2025-03-24T15:15:00",
        "details": "Saya ingin memohon perpanjangan deadline untuk tugas Pemodelan Sistem karena harus merawat orang tua yang sedang sakit. Saya telah melampirkan surat keterangan dari rumah sakit.",
        "responseDate": "",
        "response": "",
        "status": "Pending"
    },
    {
        "feedbackId": 16,
        "nim": "1301210067",
        "name": "MUHAMMAD RIZKI",
        "kelas": "TK-44-02",
        "title": "Konsultasi Program Exchange",
        "feedbackDate": "2025-03-25T10:30:00",
        "details": "Saya tertarik untuk mengikuti program pertukaran mahasiswa ke Korea Selatan semester depan. Apakah ada persyaratan khusus dan bagaimana prosedur pendaftarannya?",
        "responseDate": "",
        "response": "",
        "status": "Pending"
    },
    {
        "feedbackId": 17,
        "nim": "1301190056",
        "name": "NADIA PUTRI",
        "kelas": "TI-45-01",
        "title": "Laporan Fasilitas Rusak",
        "feedbackDate": "2025-03-20T13:20:00",
        "details": "Saya ingin melaporkan beberapa komputer di Lab Pemrograman lantai 2 yang tidak berfungsi dengan baik. Monitor berkedip dan beberapa keyboard tidak responsif.",
        "responseDate": "2025-03-22",
        "response": "Terima kasih atas laporannya. Tim teknisi sudah ditugaskan untuk memeriksa dan memperbaiki peralatan tersebut dalam 3 hari kerja. Sementara itu, Anda dapat menggunakan Lab Pemrograman di lantai 3 sebagai alternatif.",
        "status": "In Progress"
    },
    {
        "feedbackId": 18,
        "nim": "1301200198",
        "name": "OEMAR BAKTI",
        "kelas": "SI-44-02",
        "title": "Permintaan Informasi Kompetisi",
        "feedbackDate": "2025-03-23T09:10:00",
        "details": "Saya mencari informasi tentang kompetisi hackathon atau lomba pemrograman yang disponsori oleh kampus dalam waktu dekat. Apakah ada jadwal atau informasi pendaftaran?",
        "responseDate": "2025-03-24",
        "response": "Kampus akan menyelenggarakan Annual Hackathon pada tanggal 15-17 Mei 2025. Pendaftaran dibuka mulai 1 April melalui portal kemahasiswaan. Selain itu, ada juga kompetisi Competitive Programming pada bulan Juni. Semua informasi lengkap dapat dilihat di papan pengumuman digital fakultas.",
        "status": "Resolved"
    },
    {
        "feedbackId": 19,
        "nim": "1301210112",
        "name": "PUTRI HANDAYANI",
        "kelas": "TK-43-05",
        "title": "Permohonan Cuti Akademik",
        "feedbackDate": "2025-03-24T14:00:00",
        "details": "Saya bermaksud mengajukan cuti akademik untuk semester depan karena alasan kesehatan. Apa saja dokumen yang perlu saya siapkan dan bagaimana prosedurnya?",
        "responseDate": "",
        "response": "",
        "status": "Pending"
    },
    {
        "feedbackId": 20,
        "nim": "1301200034",
        "name": "QORI AMALIAH",
        "kelas": "TI-44-03",
        "title": "Konsultasi Nilai UTS",
        "feedbackDate": "2025-03-25T11:45:00",
        "details": "Saya ingin berkonsultasi mengenai nilai UTS mata kuliah Jaringan Komputer yang menurut saya ada kesalahan perhitungan. Saya telah memeriksa jawaban saya dengan kunci jawaban yang diberikan.",
        "responseDate": "",
        "response": "",
        "status": "Pending"
    }
]